app/controllers/user_searches_controller.rb

SELECT "user_searches".* FROM "user_searches"
---
    def index
        user_searches = UserSearch.all

INSERT INTO "user_searches" ("reddit_username", "top_listing_name", "top_listing_likes", "top_listing_link", "fav_sub_name", "most_children_name", "Most_children_likes", "most_children_link", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "rachid1"], ["LIMIT", 1]]
INSERT INTO "favorites" ("user_id", "user_search_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["user_search_id", 12], ["created_at", "2019-12-05 22:08:28.768149"], ["updated_at", "2019-12-05 22:08:28.768149"]]
---
    def create
        puts "hello I'm here"
        user_search = UserSearch.new(user_search_params)
        if user_search.save
            puts "hello I'm here NOW"
            username = User.find_by(username: params[:username])
            favorite = Favorite.new(user_id: username.id, user_search_id: user_search.id)
            favorite.save